# Flow Transition Characteristic Enumeration

Source: https://www.revitapidocs.com/2026/79a720e0-759d-6ad9-d34b-267daac58919.htm

---

| Flow Transition Characteristic Enumeration |
| --- |

The flow transition characteristic of the analytical segment.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum FlowTransitionCharacteristic
```

```
Public Enumeration FlowTransitionCharacteristic
```

```
public enum class FlowTransitionCharacteristic
```

```
type FlowTransitionCharacteristic
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Contraction | 2 | The segment profile is contracting along the flow direction. |
| Expansion | 1 | The segment profile is expanding along the flow direction. |
| Undefined | 0 | The flow transition characteristic is undefined. |

See Also

#### Reference

Autodesk.Revit.DB.Analysis Namespace